"use client"

import React from 'react'
import ReturnButton from '@/app/components/returnButton'
import Question from '@/app/components/Question'
import QuestionInput from '@/app/components/questionInput'

const page = () => {
  return (
    <div className='bg-ColorPalete_4 duration-500 shadow-xl mx-auto flex flex-col justify-center items-center min-h-[100vh] w-[100vw] px-3 py-2'>
    {/* border */}
    <div className='border-2 min-h-[95vh] bg-white rounded-2xl w-[95vw] border-ColorPalete_2'>
    {/* Return button */}
    <ReturnButton link='/'/>
    <div className='gap-5 flex flex-col mx-5 font-bold text-ColorPalete_1'>
        {/* header */}
        <h1 className='mt-20  text-[2rem]'>Lesson : aₙ</h1>
        {/* lesson */}
        <p className='ml-3 font-medium text-ColorPalete_1 opacity-90'>aₙ เป็นสูตรที่สำคัญมากๆสูตรนึ่ง เพราะว่า **หัวใจสำคัญในการ หาค่าของอนุกรมเลขคณิต หรือ ว่าเรขาคณิต คือ a1 และ d,r ซึ่งถ้าโจทย์ไม่ได้ให้ค่าใดค่านึ่งมาเรา สามารถหาค่าที่ขาดได้จากสูตรนี้</p>
        <div className='ml-3 font-medium text-Colordivalete_1 opacity-90'>
            <div className='bg-ColorPalete_4 bg-opacity-75 ml-[-1rem] max-w-[700px] my-5 rounded-2xl px-3 py-5 border-ColorPalete_3 shadow-lg border-2'>
                <h2 className='font-bold'>ข้อควรรู้ :</h2>
                <p className='mx-3'>สูตการหา aₙ นั้นมี 2 สูตรต่างกันที่ประเภทของอนุกรม</p>
                <ul className='mx-5'>
                    <li>1. <span className='font-bold'>อนุกรมเลขคณิต</span> : เราจะใช้สูตรว่า aₙ = a₁ + (n - 1) d</li>
                    <li>2. <span className='font-bold'>อนุกรมเรขาคณิต</span> : เราจะใช้สูตรว่า aₙ = a₁ × r ⁿ ⁻ ¹ </li>
                </ul>
            </div>
            <p className='font-bold mt-7'>วิธีคิด : อนุกรมเลขคณิต</p>
            <ul className='mx-2 flex flex-col gap-3'>
                <li>โดยส่วนมากสิ่งที่โจทย์ให้มาจะมี a₁ และ d มาอยู่แล้ว เหลือแค่ต้องตีโจทย์ดีๆว่าเขาต้องการอะไร</li>
                <li>เช่น "จงหาพจน์ใดๆของอนุกรมเลขคณิตนี้ 1 + 4 + 7 + 10 + ..."</li>
                <ul className='mx-2'>
                    <li>- สิ่งที่เราได้มาคือ a₁ แน่นอนอยู่แล้วว่าคือ 1 และ d ว่าคือ 3 เพราะว่า d ได้มาจากเอา a₂ - a₁</li>
                    <li>- หลังจากนี้เราจะเอามาเข้าสูตรกัน aₙ = 1 + (n - 1) 3 เรายังไม่รู้ค่า n เพราะงั้นใส่เป็นตัวแปรไปก่อนได้</li>
                    <li>- เราเริ่มแก้สมการด้วยคูณกระจายเข้าไปใน () จะได้เป็น aₙ = 1 + 3n - 3</li>
                    <li>- สุดท้ายจะได้เป็น aₙ = 3n - 2 เราสามารถแก้สมการได้แค่นี้ก็จะได้พจน์ทั่วไปมาแล้ว เราจะมาตรวจว่าสมการของเราถูกต้องหรือไม่ด้วยแทนค่า 1 , 2 , 3 เข้าไปจะต้องมีค่า = a₁ , a₂ , a₃</li>
                    <li>- แทนเลขเข้าไปใน aₙ = 3n - 2 จะได้เป็น a₁ , a₂ , a₃ = 3(1 , 2 , 3) - 2 ซึ่งผลจะออกมาได้ 1 , 4 , 7 แสดงว่าสมการของเรานั้นถูกต้อง</li>
                    <li>- จากพจน์ทั่วไปนี้ในอนาคตถ้าเราอยากรู้พจน์ที่ มากกว่านี้เช่น 100 ก็สามารถหาได้ด้วยการเอา 100 ไปแทนใน n</li>
                </ul>
                <li>ถ้าเกินว่าเรามีอนุกรมเลขคณิตแบบนี้ 1 + 4 + 7 + 10 + ... + 289 จงหาว่าพจน์สุดท้่านคือพจน์ที่เท่าไร</li>
                <ul className='mx-2'>
                    <li>- จะเห็นว่าจากอนุกรมนี้เรารู้ aₙ อยู่แล้วว่าคือ 289 เพราะงั้น aₙ = 289</li>
                    <li>- แล้วเราจะหาว่าอนุกรมนี้มีกี่พจน์ได้ยังไงละ เราต้องลองแตกโครงสร้างของมันดู ว่า aₙ เกินจากอะไร</li>
                    <li>- aₙ เกิดจาก a₁ + (n - 1) d เพราะงั้น 289 = a₁ + (n - 1) d เรารู้ค่าของ a₁ และ d อยู่แล้วแทนค่าไปได้เลย</li>
                    <li>- 289 = 3n - 2 นี้คือที่เราเคยหาได้จากสมการที่แล้วเราสามารถหาได้เลยว่าอะไร ท่ีคูณ 3 แล้วลบด้วย 2 เท่ากับ 289</li>
                    <li>- แต่ถ้าเราอยากทำให้ง่ายขึ้นก็ย้ายข้างมันมา (289 + 2) ➗ 3 = n เพราะงั้น n จึ่งมีค่าเท่ากับ 97 นั้นเอง</li>
                    <li>- สรุปได้ว่าอนุกรมนี้มี 97 พจน์</li>
                </ul>
            </ul>

            <Question question='1 + 3 + 5 + ... จงหาพจน์ทั่วไปของอนุกรมเลขคณิตนี้' answer={1} choice1='2n - 1' choice2='2n + 1' choice3='n + 2' choice4='n - 1'/>
            <Question question='5 + 15 + 25 + ... จงหาพจน์ทั่วไปของอนุกรมเลขคณิตนี้' answer={4} choice1='n + 10' choice2='n - 10' choice3='15n' choice4='10n - 5'/>
            <Question question='30 + 15 + 0 + ... จงหาพจน์ทั่วไปของอนุกรมเลขคณิตนี้' answer={2} choice1='15n' choice2='45 - 15n' choice3='30 + n' choice4='30 - 15n'/> 

            <p className='font-bold mt-7'>Situations : อนุกรมเลขคณิต</p>
            <ul className='mx-2 flex flex-col gap-3'>
                <li>Situations คือประเภทของโจทย์ที่มักเจอ แต่ละ Situations ก็จะมีวิธีการแก้ที่แตกต่างกันดั้งต่อไปนี้</li>
                <ul className='mx-2'>
                    <div className='bg-ColorPalete_4 bg-opacity-75 ml-[-1rem] max-w-[700px] my-5 rounded-2xl px-3 py-5 border-ColorPalete_3 shadow-lg border-2'>
                          <h2 className='font-bold'>ข้อควรรู้ :</h2>
                          <p className='mx-3'>ก่อนที่เราจะไปดู Situations ต่างๆเราต้องรู้คุณสมบัติบางข้อของอนุกรมเลขคณิตก่อน</p>
                          <ul className='mx-5'>
                              <li>1. ถ้าจำนวนพจน์ของอนุกรมนั้นเป็นเลขคี่ เราสามารถระบุได้ว่า พจน์ตรงนับไปทางซ้ายจะ ลดลงไป 1d และทางขวาเพิ่มมา 1d เป็นอย่างนี้ไปเลื่อย ถ้าไปทางขวา 2 ช่องก็ +2d</li>
                              <li>2. ถ้าจำนวนพจน์ของอนุกรมนั้นเป็นเลขคู่ เราสามารถระบุได้ว่า พจน์ตรงกลางทางซ้ายจะมีค่าเท่ากับ a - d แล้วพจน์ตรงกลางทางขวาจะมีค่าเท่ากับ a + d นับไปทางซ้าจะลดลง 1d เหมือนเดิมและทางขวาก็เป็นเพิ่มขึ้น 1d เพราะงั้นถ้า ไปทางขวา 2 ช่องก็เป็น +2d และ 3 ช่องก็เป็น + 3d (นับช่องตรงกลางทางขวา)</li>
                          </ul>
                    </div>
                    <li>- Situations ที่ 1 : เราได้ Random a มา 2 ตัวและ ไม่ใช่ a₁ แบบนี้ a₅ = 29 และ a₅₁ = 397</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- เราต้องแตกโครงสร้างออกมาก่อน เป็น a₅ = a₁ + 4d และ a₅₁ = a₁ + 50d โด้ยเราจะให้ทั้ง 2 สมการนี้แทนสมการที่ ① และ ②</li>
                        <li>- ในกรณีแบบนี้เรามีตัวแปร 2 ตัวที่ยังหาค่าไม่ได้เราเลยต้องกำจัดให้เหลือแค่ตัว แปรเดียวก่อนด้วยการ เอาสมการ ② - ① </li>
                        <li>- ② - ① = a₁ + 50d - a₁ + 4d = 46d และเราเขียนได้ว่า 397 - 29 = 46d เราก็เอา 46 ย้านไปหารได้</li>
                        <li>- d = 8 เราได้ d จากสมการนี้แล้วเราก็สามารถหาค่า a₁ ได้ด้วยการนำสมการก่อนๆมาแทนเช่น a₁ = a₅ (29) - 4d (4 × 8)</li>
                        <li>- เราจะได้ว่า a₁ มีค่าเป็น -3 จากนั้นเรามาหาพจน์ทั่วไปต่อจากนี้กัน aₙ = -3 + 8n - 8</li>
                        <li>- คำตอบก็จะเป็น aₙ = 8n - 11 ลองแทน 5 เข้าไปใน n ดูก็จะเอากับ 29 หรือเท่ากับ a₅ แสดงว่าสมการนี้ถูกต้อง</li>
                    </ul>
                    <QuestionInput
                        question='a₅ = "33" , a₈₁ = "565" จงหาพจน์ทั่วไปของอนุกรมเลขคณิตนี้ (ตอบไม่ต้องเว้นวรรค)' 
                        answer="7n-2" 
                    />
                    <li>- Situations ที่ 2 : เราได้ a₁ ได้ d และได้ค่าของพจน์สุดท้ายมาหรือว่า aₙ มาเช่น a₁ = 24 , d = -5 , aₙ = -46</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- จากสิ่งที่เราได้รับมานี้เรารู้อยู่แล้วว่าเราได้ a₁ และ d การที่จะหาพจน์ทั่วไปก็ไม่ยาก แต่ว่าถ้าโจทย์เขาถามว่าอนุกรมนี้มีกี่พจน์หรือว่าพจน์สุดท้ายคือพจน์ที่เท่าไร</li>
                        <li>- เราจะสามารถหาได้ด้วยการแทนค่าลงไปในสูตรเหมือนเดิมตามสิ่งที่โจทย์ให้เรามา -46 = 24 + (n -1)(-5) </li>
                        <li>- ในสมการนี้เหลือตัวแปรแค่ตัวแปรเดียวเพราะงั้นก็แก้สมการต่อๆเลื่อยๆก็จะได้คำตอบออกมา -46 = 24 -5n + 5</li>
                        <li>- ก็จะได้ว่า n = 15 แสดงว่าอนุกรมนี้มีทั้งหมด 15 พจน์นั้นเอง</li>
                    </ul>
                    <QuestionInput
                        question=' 9 + 15 + 21 + ... + 75 จงหาพจน์สุดท้ายของอนุกรมเลขคณิตนี้คือพจน์ที่เท่าไร (ตอบไม่ต้องเว้นวรรค)' 
                        answer="12" 
                    />
                    <li>- Situations ที่ 3 : เราได้เงือนไขจำนวนพจน์มาเช่น อนุกรมมีจำนวน 4 พจน์และได้สมบัติมาเช่น a₂ × a₃ มากกว่า a₁ × a₄ อยู่ 32 และ a₂ × a₄ มากกว่า a₁ × a₃ อยู่ 72 </li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- เราต้องแตกโครงสร้างออกมาตามคุณสมบัติพจน์มี 4 พจน์เพราะงั้นเป็นเลขคู่ a₁ = (a-2d) a₂ = (a-d) a₃ = (a+d) a₄ = (a+2d)</li>
                        <li>- พอแทนค่าเข้าไปในสมบัติที่ได้มาก็จะเป็น [(a-d) × (a+d)] - [(a-3d) × (a+3d)] = 32</li>
                        <li>- เราจะเขียนสมการในอีกรูปได้ว่า a² - d² - a² + 9d² = 32 และย่อได้ว่า 8d² = 32</li>
                        <li>- เพราะงั้นสมการแรก d = ±2 แล้วเราก็เอาค่านี้ไปแทนในสมการที่ 2 ผลจะออกมาเป็น a = 9 , -9</li>
                        <li>- แทนย้อนกลับไปใน a₁ = (a-2d) a₂ = (a-d) a₃ = (a+d) a₄ = (a+2d) ก็จะได้เป็น ±3 , ±7 , ±11 , ±15</li>
                    </ul>
                    <QuestionInput
                        question='มีจำนวน 4 จำนวนเป็นลำดับเลขคณิต โดยผลคูณของจำนวนที่ 2 และ 3 มากกว่าผลคูณของจำนวนที่ 1 และ 4 อยู่ 40 และผลคูณของจำนวนที่ 2 และ 4 มากกว่าผลคูณของจำนวนที่ 1 และ 3 อยู่ 80 จงหาค่าของอนุกรมนี้ (ตอบในรูปแบบ a₁, a₂, a₃, a₄ โดยคั่นด้วยเครื่องหมายจุลภาค , เช่น 1, 2, 3, 4)' 
                        answer="4, 8, 12, 16" 
                    />
                    <li>- Situations ที่ 4 : โจทย์ให้ข้อมูลว่ามีพจน์ที่อยู่ระหว่าง 150 - 400 ที่หารด้วย 8 ลงตัว อยู่ n พจน์จงหาค่า n ออกมา</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- จากโจทย์เราจะได้ค่า d ออกทาจากผลที่หารลงตัว (8) และหาค่า a₁ และ aₙ ด้วยการเอา 150 และ 400 มาหาร 8 แล้วหาค่าระหว่าง 150-400 ออกมา</li>
                        <li>- ก็จะได้ 150 ➗ 8 จะได้ 18 เศษ 6 แต่โจทย์บอกว่าลงตัวเพราะงั้น +2 เข้าไปจะได้ลงตัวและ a₁ = 152 และ 400 หาร 8 จะเท่ากับ 50 พอดีแต่โจทย์บอกว่าอยู่ระหว่าง 150 - 400 จึ่งต้องลบออก 8 จะได้ aₙ = 392</li>
                        <li>- เราจะได้ a₁ , aₙ , d มาแล้วเพราะงั้นเราใช้วิธีีการเดียวกันกับ Situations ที่ 2 เพราะงั้นพจน์สุดท้ายหรือพจน์ทั้งหมดก็คือ n = 31 พจน์</li>
                    </ul>
                    <QuestionInput
                        question='มีจำนวนเต็มระหว่าง 200 และ 600 ที่หารด้วย 12 ลงตัวอยู่ n พจน์ จงหาค่า n ออกมา (ตอบเป็นตัวเลขจำนวนเต็ม เช่น 20)' 
                        answer="33" 
                    />
                    <li>- Situations ที่ 5 : เราได้ a₁ และพจน์สุดท้ายมา เช่น a₁ = 2 และ a₈ = 30 จงหาค่าของพจน์ที่ a₂ ถึง a₇</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- แตกโครงสร้างพื้นฐานออกมาได้ว่า a₈ = a₁ + 7d แทนค่าในสมการออกมาได้ว่า 2 + 7d = 30</li>
                        <li>- ก็จะได้ค่า d = 28 ➗ 7 หรือ d + 4 แล้วก็เทนค่าเข้าไปในแต่ละพจน์ ก็จะได้ 2 + 6 + 10 + 14 + 18 + 22 + 26 + 30</li>
                    </ul>
                    <QuestionInput
                        question='ในลำดับเลขคณิตที่ a₁ = 5 และ a₁₀ = 50 จงหาค่าของพจน์ที่ a₂ ถึง a₉ (ตอบในรูปแบบตัวเลขคั่นด้วยเครื่องหมายจุลภาค , เช่น 10, 15, 20, ...)' 
                        answer="10, 15, 20, 25, 30, 35, 40, 45" 
                    />
                    <li>- Situations ที่ 6 : เราได้ a₁ และพจน์สุดท้ายมา เช่น a₁ = 2 และ a₈ = 30 จงหาค่าของพจน์ที่ a₂ ถึง a₇</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- แตกโครงสร้างพื้นฐานออกมาได้ว่า a₈ = a₁ + 7d แทนค่าในสมการออกมาได้ว่า 2 + 7d = 30</li>
                        <li>- ก็จะได้ค่า d = 28 ➗ 7 หรือ d + 4 แล้วก็เทนค่าเข้าไปในแต่ละพจน์ ก็จะได้ 2 + 6 + 10 + 14 + 18 + 22 + 26 + 30</li>
                    </ul>
                    <QuestionInput
                        question='ในลำดับเลขคณิตที่ a₁ = 5 และ a₁₀ = 77 จงหาค่าของพจน์ที่ a₂ ถึง a₉ (ตอบในรูปแบบตัวเลขคั่นด้วยเครื่องหมายจุลภาค , เช่น 10, 15, 20, ...)' 
                        answer="13, 21, 29, 37, 45, 53, 61, 69" 
                    />
                    <li>- Situations ที่ 7 : เราได้ a₁ และพจน์สุดท้ายมา เช่น a₁ = 2 และ a₈ = 30 จงหาค่าของพจน์ที่ a₂ ถึง a₇</li>
                    <ul className='mx-2 flex flex-col gap-3 my-5'>
                        <li>- แตกโครงสร้างพื้นฐานออกมาได้ว่า a₈ = a₁ + 7d แทนค่าในสมการออกมาได้ว่า 2 + 7d = 30</li>
                    </ul>
                    <QuestionInput
                        question='ในลำดับเลขคณิตที่ a₁ = 5 และ a₁₀ = 77 จงหาค่าของพจน์ที่ a₂ ถึง a₉ (ตอบในรูปแบบตัวเลขคั่นด้วยเครื่องหมายจุลภาค , เช่น 10, 15, 20, ...)' 
                        answer="13, 21, 29, 37, 45, 53, 61, 69" 
                    />
                    </ul>
                </ul>
            </div>
        </div>
      </div>
    </div>
  )
}

export default page
